export const PGUp = {
  Monday: [
    {num: '3', time: '12:50 - 14:10',  name: 'Теория вероятностей и мат. статистики пр.', teach: 'Базанова С.В. ', cab: '305'},
    {num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'ст.преп. Бульбанович С.В.', cab: 'спорт. зал'},
    {num: '5', time: '15:50 - 17:10', name: 'Теория вероятностей лк. (27.10.2025)', teach: 'Базанова С.В. ', cab: '305'},
  ],
  Tuesday: [
    {num: '1', time: '9:00 - 10:20', name: 'Численные методы лк.', teach: 'Голикова Е.И.', cab: '304'},
    {num: '2', time: '10:30 - 11:50', name: 'Базы данных пр.', teach: 'Федоркевич Е.В ', cab: '303'},
    {num: '3', time: '12:50 - 14:10', name: 'Методика обучения информатике лк.', teach: 'Бороненко Т.А. ', cab: '307'},
  ],
  Wednesday: [
    {num: '3', time: '12:50 - 14:10', name: 'Теория функций комплексного переменного пр. (01.10.2025)', teach: 'Игнатьева И.В.', cab: '308'},
    {num: '4', time: '14:20 - 15:40', name: 'Методика обучения информатике пр.', teach: 'Горшкова Т.Ю.', cab: '109'},
    {num: '5', time: '15:50 - 17:10', name: 'Физ-ра пр.', teach: 'ст.преп. Бульбанович С.В.', cab: 'спорт. зал'},
  ],
  Thursday: [
    {num: '1', time: '9:00 - 10:20', name: 'Базы данных пр.', teach: 'Федоркевич Е.В', cab: '303'},
    {num: '2', time: '10:30 - 11:50', name: 'Операционные системы пр.', teach: 'Федоркевич Е.В.', cab: '303'},
    {num: '3', time: '12:50 - 14:10', name: 'Основы вожатской деятельности пр.', teach: 'Архиповская Е.П.', cab: '113'},
    {num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр. (13.11.2025, 27.11.2025)', teach: 'ст.преп. Бульбанович С.В.', cab: 'спорт. зал'},
  ],
  Friday: [
    {num:'4',time: '14:20 - 15:40', name: 'Теория функций комплексного переменного пр', teach: 'Игнатьева И.В.', cab: '305'},
    {num:'5',time: '15:50 - 17:10', name: 'Математическая логика и теория алгоритмов пр.', teach: 'Игнатьева И.В.', cab: '305'},
    {num:'6',time: '17:20 - 18:40', name: 'Математическая логика и теория алгоритмов лк.', teach: 'Игнатьева И.В.', cab: '305'},
  ],
  Saturday: [
    {num:'4',time: '14:20 - 15:40', name: 'Численные методы лб. (13.12.2025)', teach: 'Голикова Е.И.', cab: 'ДОТ'},
    {num:'5',time: '15:50 - 17:10', name: 'Профилактика наркомании в школе лк/лб. ', teach: 'Родыгина Ю. К.', cab: 'ДОТ'},
  ],
};

export const PGDown = {
  Monday: [
    {num: '2', time: '10:30 - 11:50',  name: 'Теория вероятностей и мат. статистики лк.', teach: 'Базанова С.В. ', cab: '305'},
    {num: '3', time: '12:50 - 14:10',  name: 'Теория вероятностей и мат. статистики пр.', teach: 'Базанова С.В. ', cab: '305'},
    {num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'ст.преп. Бульбанович С.В.', cab: 'спорт. зал'},
  ],
  Tuesday: [
    {num: '1', time: '9:00 - 10:20', name: 'Численные методы пр.', teach: 'Голикова Е.И.', cab: '304'},
    {num: '2', time: '10:30 - 11:50', name: 'Численные методы пр.', teach: 'Голикова Е.И.', cab: '304'},
    {num: '3', time: '12:50 - 14:10', name:  'Базы данных пр.', teach: 'Федоркевич Е.В ', cab: '303'},
    {num: '4', time: '14:20 - 15:40', name: 'Методика обучения информатике пр.', teach: 'Горшкова Т.Ю.', cab: '304'},
    {num: '5', time: '15:50 - 17:10', name: 'Операционные системы, сети и интернет-технологии лк. (02.12.2025)', teach: 'Федоркевич Е.В.', cab: '303'},
  ],
  Wednesday: [],
  Thursday: [
    {num: '1', time: '9:00 - 10:20', name: 'Базы данных пр.', teach: 'Федоркевич Е.В', cab: '303'},
    {num: '2', time: '10:30 - 11:50', name: 'Операционные системы лк.', teach: 'Федоркевич Е.В.', cab: '303'},
    {num: '3', time: '12:50 - 14:10', name: 'Операционные системы пр.', teach: 'Федоркевич Е.В.', cab: '303'},
    {num: '4', time: '14:20 - 15:40', name: 'Основы вожатской деятельности лк.', teach: 'Архиповская Е.П.  ', cab: '113'},
  ],
  Friday: [
    {num:'4',time: '14:20 - 15:40', name: 'Теория функций комплексного переменного пр', teach: 'Игнатьева И.В.', cab: '305'},
    {num:'5',time: '15:50 - 17:10', name: 'Математическая логика и теория алгоритмов пр.', teach: 'Игнатьева И.В.', cab: '305'},
    {num:'6',time: '17:20 - 18:40', name: 'Теория функций комплексного переменного лк.', teach: 'Игнатьева И.В.', cab: '305'},
  ],
  Saturday: [
    {num:'5',time: '15:50 - 17:10', name: 'Профилактика наркомании в школе лк/лб. ', teach: 'Родыгина Ю. К.', cab: 'ДОТ'},
  ],
}

