const now = new Date();
const dates = {
  marchSecond: new Date(2026, 2, 2, 0, 0, 0),
  marchSixTeen: new Date(2026, 2, 16, 0, 0, 0),
  marchTwentyOne: new Date(2026, 2, 21, 0, 0, 0),
  marchTwentyThree: new Date(2026, 2, 23, 0, 0, 0),
  marchThirty: new Date(2026, 2, 30, 0, 0, 0),
  aprilSix: new Date(2026, 3, 6, 0, 0, 0),
  aprilEightTeen: new Date(2026, 3, 18, 0, 0, 0),
  mayFourTeen: new Date(2026, 4, 14, 0, 0, 0),
};

export const PGUp = {
  Monday: [
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Бульбанович С.В.', cab: 'спорт. зал' },
    { num: '5', time: '15:50 - 17:10', name: 'Теоретические основы информатики лк.', teach: 'Голикова Е.И.', cab: '304' },
    (now <= dates.marchSecond) ? //02.03
      { num: '6', time: '17:20 - 18:40', name: '(02.03)Математическая логика и теория алгоритмов лк.', teach: 'Голикова Е.И.', cab: '304' } :
      (now <= dates.marchSixTeen) ? //16.03
        { num: '6', time: '17:20 - 18:40', name: '(16.03)Численные методы лк.', teach: 'Голикова Е.И.', cab: '304' } :
        (now <= dates.marchThirty) ? //30.03
          { num: '6', time: '17:20 - 18:40', name: '(30.03)Численные методы лк.', teach: 'Голикова Е.И.', cab: '304' } : '',
  ],
  Tuesday: [
    { num: '1', time: '9:00 - 10:20', name: 'Математическая теория игр пр.', teach: 'Базанова С.В.', cab: '308' },
    { num: '2', time: '10:30 - 11:50', name: 'Методика обучения информатике лк.', teach: 'Бороненко Т.А.', cab: '307' },
    { num: '3', time: '12:50 - 14:10', name: 'Операционные системы, сети и интернет-технологии лк.', teach: 'Федоркевич Е.В.', cab: '303' },
    { num: '4', time: '14:20 - 15:40', name: 'Базы данных лб', teach: 'Федоркевич Е.В.', cab: '303' },
  ],
  Wednesday: [
    { num: '4', time: '14:20 - 15:40', name: 'Базы данных лб.', teach: 'Федоркевич Е.В.', cab: 'ДОТ' },
    { num: '7', time: '18:50 - 20:10', name: 'Методика обучения математике пр.', teach: 'Семенистая Т.В.', cab: 'ДОТ' },
  ],
  Thursday: [
    { num: '1', time: '9:00 - 10:20', name: 'Педагогическая диагностика в образовательном процессе пр', teach: 'Морозова М.И. ', cab: '113' },
    { num: '2', time: '10:30 - 11:50', name: 'Правовые основы образовательной деятельности	пр.', teach: 'Акишин М. О.', cab: '308' },
    { num: '3', time: '12:50 - 14:10', name: 'Численные методы лб.', teach: 'Голикова Е.И.', cab: '304' },
    { num: '4', time: '14:20 - 15:40', name: 'Теоретические основы информатики лб.', teach: 'Голикова Е.И.', cab: '304' },
    (now <= dates.mayFourTeen) ?
      { num: '5', time: '15:50 - 17:10', name: 'Физ-ра пр.', teach: 'Бульбанович С.В.', cab: 'спорт. зал' } : '',
  ],
  Friday: [],
  Saturday: [
    (now <= dates.marchTwentyOne) ? //21.03
      { num: '2', time: '10:30 - 11:50', name: '(21.03)Правовые основы образовательной деятельности	лк.', teach: 'Акишин М. О.', cab: 'ДОТ' } :
      (now <= dates.aprilEightTeen) ? //18.04
        { num: '2', time: '10:30 - 11:50', name: '(18.04)Инклюзивное образование детей с ограниченными возможностями здоровья лк.', teach: 'Иванов О. С.', cab: 'ДОТ' } : '',

    { num: '3', time: '12:50 - 14:10', name: 'Инклюзивное образование детей с ограниченными возможностями здоровья лк./пр.', teach: 'Иванов О. С.', cab: 'ДОТ' },


  ],
};

export const PGDown = {
  Monday: [
    { num: '2', time: '10:30 - 11:50', name: 'Математическая теория игр лк.', teach: 'Базанова С.В. ', cab: '308' },
    { num: '3', time: '12:50 - 14:10', name: 'Численные методы лк.', teach: 'Голикова Е.И.', cab: '307' },
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Бульбанович С.В.', cab: 'спорт. зал' },
    (now <= dates.marchTwentyThree) ? //23.03
      { num: '5', time: '15:50 - 17:10', name: '(23.03)Математическая теория игр лк.', teach: 'Базанова С.В.', cab: '308' } :
      (now <= dates.aprilSix) ? //06.04
        { num: '5', time: '15:50 - 17:10', name: '(06.04)Математическая теория игр лк.', teach: 'Базанова С.В.', cab: '308' } : '',
  ],
  Tuesday: [
    { num: '1', time: '9:00 - 10:20', name: 'Базы данных лк.', teach: 'Федоркевич Е.В.', cab: '303' },
    { num: '2', time: '10:30 - 11:50', name: 'Операционные системы, сети и интернет-технологии лб.', teach: 'Федоркевич Е.В.', cab: '303' },
    { num: '3', time: '12:50 - 14:10', name: 'Операционные системы, сети и интернет-технологии лб.', teach: 'Федоркевич Е.В ', cab: '303' },
  ],
  Wednesday: [
    { num: '3', time: '12:50 - 14:10', name: 'Методика обучения информатике лб.', teach: 'Горшкова Т.Ю. ', cab: '109' },
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Бульбанович С.В.', cab: 'спорт. зал' },
  ],
  Thursday: [
    { num: '3', time: '12:50 - 14:10', name: 'Численные методы лб.', teach: 'Голикова Е.И.', cab: '304' },
    { num: '4', time: '14:20 - 15:40', name: 'Теоретические основы информатики лб.', teach: 'Голикова Е.И.', cab: '304' },
    { num: '5', time: '15:50 - 17:10', name: 'Методика обучения математике лк.', teach: 'Семенистая Т.В. ', cab: '308' },
    { num: '6', time: '17:20 - 18:40', name: 'Методика обучения математике пр.', teach: 'Семенистая Т.В. ', cab: '308' },
  ],
  Friday: [
    { num: '1', time: '9:00 - 10:20', name: 'Педагогическая диагностика в образовательном процессе лк.', teach: 'Морозова М.И.', cab: '303' },
    { num: '2', time: '10:30 - 11:50', name: 'Педагогическая диагностика в образовательном процессе gh.', teach: 'Морозова М.И.', cab: '303' },
  ],
  Saturday: [
    { num: '2', time: '10:30 - 11:50', name: 'Правовые основы образовательной деятельности	лк.', teach: 'Акишин М. О.', cab: 'ДОТ' },
    { num: '3', time: '12:50 - 14:10', name: 'Инклюзивное образование детей с ограниченными возможностями здоровья лк./пр.', teach: 'Иванов О. С.', cab: 'ДОТ' },
  ],
}

