export const PG2Up = {
  Monday: [
    {num: '1', time: '9:00 - 10:20', name: 'Теория вероятностей и мат. статистики лк.', teach: 'Шоренко И.Н.', cab: '308'},
    {num: '2', time: '10:30 - 11:50', name: 'Теория вероятностей и мат. статистики пр.', teach: 'Шоренко И.Н.', cab: '308'},
    {num: '3', time: '12:50 - 14:10', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт.зал'},
    {num: '4', time: '14:20 - 15:40', name: 'Мат. логика и теория алгор. лк.', teach: 'Макардина В.А.', cab: '304'}
  ],
  Tuesday: [
    {num: '1', time: '9:00 - 10:20', name: 'Основы ИИ лк.', teach: 'Федоркевич Е.В.', cab: '305'},
    {num: '2', time: '10:30 - 11:50', name: 'Численные методы лк.', teach: 'Голикова Е.И.', cab: '304'},
    {num: '3', time: '12:50 - 14:10', name: 'Численные методы пр.', teach: 'Голанова А.В.', cab: '109  '},
  ],
  Wednesday: [],
  Thursday: [
    {num: '2', time: '10:30 - 11:50', name: 'Методы иссл. деят. в ИТ лк.', teach: 'Бороненко Т.А.', cab: '307'},
    {num: '3', time: '12:50 - 14:10', name: 'Методы иссл. деят. в ИТ пр.', teach: 'Бороненко Т.А.', cab: '307'},
    {num: '4', time: '14:20 - 15:40', name: 'Базы данных лк.', teach: ' Федоркевич Е.В.', cab: '305'},
  ],
  Friday: [
    {num: '2', time: '10:30 - 11:50', name: 'Операционные системы пр.', teach: 'Королев В.В.', cab: '109'},
    {num: '3', time: '12:50 - 14:10', name: 'Инф-ое обеспечение управ. лк.', teach: 'Королев В.В', cab: '109'},
    {num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт.зал'},
    {num: '5', time: '15:50 - 17:10', name: 'Физ-ра лк.', teach: 'Елисеева Т.П.', cab: '109'},
  ],
  Saturday: [
    {num:'4',time: '14:20 - 15:40', name: 'Базы данных пр. (ДОТ)', teach: 'Нуретдинов Р.И.', cab: 'ДОТ'},
    {num:'5',time: '15:50 - 17:10', name: 'Вычислительные системы, сети и телекомуникации (ДОТ)', teach: 'Нуретдинов Р.И.', cab: 'ДОТ'},
  ],
};

export const PG1Up = {
  Monday: [
    {num: '1', time: '9:00 - 10:20', name: 'Теория вероятностей и мат. статистики лк.', teach: 'Шоренко И.Н.', cab: '308'},
    {num: '2', time: '10:30 - 11:50', name: 'Теория вероятностей и мат. статистики лк.', teach: 'Шоренко И.Н.', cab: '308'},
    {num: '3', time: '12:50 - 14:10', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт.зал'},
    {num: '4', time: '14:20 - 15:40', name: 'Мат. логика и теория алгор. лк.', teach: 'Макардина В.А.', cab: '304'}
  ],
  Tuesday: [
    {num: '1', time: '9:00 - 10:20', name: 'Основы ИИ лк.', teach: 'Федоркевич Е.В.', cab: '308'},
    {num: '2', time: '10:30 - 11:50', name: 'Численные методы лк.', teach: 'Голикова Е.И.', cab: '308'},
    {num: '3', time: '12:50 - 14:10', name: 'Численные методы пр.', teach: 'Голикова Е.И.', cab: '307'},
    {num: '4', time: '14:20 - 15:40', name: 'Операционные системы пр.', teach: 'Федоркевич Е.В.', cab: '304'}
  ],
  Wednesday: [],
  Thursday: [
    {num: '1', time: '9:00 - 10:20', name: 'Методы иссл. деят. в ИТ пр.', teach: 'Бороненко Т.А.', cab: '307'},
    {num: '2', time: '10:30 - 11:50', name: 'Методы иссл. деят. в ИТ лк.', teach: 'Бороненко Т.А.', cab: '307'},
    {num: '3', time: '12:50 - 14:10', name: 'Базы данных пр.', teach: ' Федоркевич Е.В.', cab: '303'},
    {num: '4', time: '14:20 - 15:40', name: 'Базы данных лк.', teach: ' Федоркевич Е.В.', cab: '305'}
  ],
  Friday: [
    {num:'3',time: '12:50 - 14:10', name: 'Инф-ое обеспечение управ. лк.', teach: 'Королев В.В', cab: '109'},
    {num:'4',time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт зал.'},
    {num:'5',time: '15:50 - 17:10', name: 'Физ-ра лк.', teach: 'Елисеева Т.П.', cab: '109'},
  ],
  Saturday: [
    {num:'6',time: '17:20 - 18:40', name: 'Вычислительные системы, сети и телекомуникации (ДОТ)', teach: 'Нуретдинов Р.И.', cab: 'ДОТ'},
  ],
};

export const PG1Down = {
    Monday: [
    {num: '2', time: '10:30 - 11:50', name: 'Теория вероятностей и мат. статистики лк.', teach: 'Шоренко И.Н.', cab: '308'},
    {num: '3', time: '12:50 - 14:10', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт. зал'},
    {num: '4', time: '14:20 - 15:40', name: 'Мат. логика и теория алгор. лк.', teach: 'Макардина В.А.', cab: '304'},
    {num: '5', time: '15:50 - 17:10', name: 'Мат. логика', teach: 'Макаридина В.А.', cab: '308'},
  ],
  Tuesday: [
    {num: '2', time: '10:30 - 11:50', name: 'Основы ИИ лк.', teach: 'Федоркевич Е.В.', cab: '305'},
    {num: '3', time: '12:50 - 14:10', name: 'Численные методы пр.', teach: 'Голикова Е.И.', cab: '307'},
    {num: '4', time: '14:20 - 15:40', name: 'Базы данных пр.', teach: 'Федоркевич Е.В.', cab: '303'}
  ],
  Wednesday: [
    {num: '5', time: '15:50 - 17:10', name: 'Основы ИИ', teach: 'Федоркевич Е.В.', cab: 'ДОТ'},
  ],
  Thursday: [
    {num: '1', time: '9:00 - 10:20', name: 'Методы иссл. деят. в ИТ пр.', teach: 'Бороненко Т.А.', cab: 'ДОТ'},
    {num: '2', time: '10:30 - 11:50', name: 'Методы иссл. деят. в ИТ лк.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ'},
    {num: '3', time: '12:50 - 14:10', name: 'Вычислительные системы, сети и телекоммуникации лк.', teach: 'Нуретдинов Р.И. ', cab: 'ДОТ'},
    {num: '4', time: '14:20 - 15:40', name: 'Основы ИИ пр.', teach: 'Федоркевич Е.В.', cab: 'ДОТ'}
  ],
  Friday: [
    {num: '3', time: '12:50 - 14:10', name: 'Инф-ое обеспечение управ. пр.', teach: 'Батурина И.В. ', cab: '109'},
    {num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт.зал'},
    {num: '5', time: '15:50 - 17:10', name: 'Физ-ра лк.', teach: 'Елисеева Т.П.', cab: '109'},
  ],
  Saturday: [],
}

export const PG2Down = {
  Monday: [
    {num: '2', time: '10:30 - 11:50', name: 'Теория вероятностей и мат. статистики лк.', teach: 'Шоренко И.Н.', cab: '308'},
    {num: '3', time: '12:50 - 14:10', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт. зал'},
    {num: '4', time: '14:20 - 15:40', name: 'Мат. логика и теория алгор. лк.', teach: 'Макардина В.А.', cab: '304'},
    {num: '5', time: '15:50 - 17:10', name: 'Мат. логика', teach: 'Макаридина В.А.', cab: '304'},
  ],
  Tuesday: [
    {num: '1', time: '9:00 - 10:20', name: 'Основы ИИ пр.', teach: 'Федоркевич Е.В.', cab: '305'},
    {num: '2', time: '10:30 - 11:50', name: 'Операционные системы лк.', teach: 'Федоркевич Е.В.', cab: '305'},
    {num: '3', time: '12:50 - 14:10', name: 'Численные методы пр.', teach: 'Голанова А.В.', cab: '307'},
  ],
  Wednesday: [],
  Thursday: [
    {num: '1', time: '9:00 - 10:20', name: 'Базы данных пр.', teach: 'Нуретдинов Р.И. ', cab: 'ДОТ'},
    {num: '2', time: '10:30 - 11:50', name: 'Прикладные методы исследовательской деятельности', teach: 'Бороненко Т.А. ', cab: 'ДОТ'},
    {num: '3', time: '12:50 - 14:10', name: 'Вычислительные системы, сети и телекоммуникации лк.', teach: 'Нуретдинов Р.И. ', cab: 'ДОТ'},
    {num: '4', time: '14:20 - 15:40', name: 'Вычислительные системы, сети и телекоммуникации пр.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ'},
    {num: '5', time: '15:50 - 17:10', name: 'Основы ИИ', teach: 'Федоркевич Е.В.', cab: 'ДОТ'},
  ],
  Friday: [
    {num: '3', time: '12:50 - 14:10', name: 'Инф-ое обеспечение управ. пр.', teach: 'Королев В,В', cab: '109'},
    {num:'4',time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт. зал'},
    {num:'5',time: '15:50 - 17:10', name: 'Физ-ра лк.', teach: 'Елисеева Т.П.', cab: '109'},
  ],
  Saturday: [],

};

