const now = new Date();
const dates = {
  januaryTwentyNine: new Date(2026, 0, 29, 0, 0, 0),
  febSecond: new Date(2026, 1, 2, 0, 0, 0),
  febSeven: new Date(2026, 1, 7, 0, 0, 0),
  febTen: new Date(2026, 1, 10, 0, 0, 0),
  febTwelve: new Date(2026, 1, 12, 0, 0, 0),
  febTwentyOne: new Date(2026, 1, 21, 0, 0, 0),
  febTwentyFour: new Date(2026, 1, 24, 0, 0, 0),
  febTwentySix: new Date(2026, 1, 26, 0, 0, 0),
  marchSeven: new Date(2026, 2, 7, 0, 0, 0),
  marchTen: new Date(2026, 2, 10, 0, 0, 0),
  marchTwelve: new Date(2026, 2, 12, 0, 0, 0),
  marchFourteen: new Date(2026, 2, 14, 0, 0, 0),
  marchTwentySix: new Date(2026, 2, 26, 0, 0, 0),
  aprilFour: new Date(2026, 3, 4, 0, 0, 0),
  aprilSeven: new Date(2026, 3, 7, 0, 0, 0),
  aprilTwentyEight: new Date(2026, 3, 28, 0, 0, 0),
  mayTwelve: new Date(2026, 4, 12, 0, 0, 0),
  mayTwentyFive: new Date(2026, 4, 25, 0, 0, 0),
  mayTwentySix: new Date(2026, 4, 26, 0, 0, 0),
};


export const PG2Up = {
  Monday: [
    { num: '1', time: '9:00 - 10:20', name: 'Численные методы лк.', teach: 'Голикова Е.И.', cab: '307' },
    { num: '2', time: '10:30 - 11:50', name: 'Численные методы лб.', teach: 'Голикова Е.И. ', cab: '307' },
    { num: '3', time: '12:50 - 14:10', name: 'Архитектура компьютера лб.', teach: 'Голикова Е.И. ', cab: '307' },
    { num: '4', time: '14:20 - 15:40', name: 'Теоретические основы информатики лб.', teach: 'Голикова Е.И.', cab: '109' }
  ],
  Tuesday: [
    (now <= dates.mayTwelve) ?
      { num: '1', time: '9:00 - 10:20', name: '(12.05) Вычислительные системы, сети и телекоммуникации', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } : '',

    (now <= dates.mayTwelve) ?
      { num: '2', time: '10:30 - 11:50', name: '(12.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } :
      (now <= dates.mayTwentySix) ?
        { num: '2', time: '10:30 - 11:50', name: '(26.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } : '',

    (now <= dates.mayTwelve) ?
      { num: '5', time: '15:50 - 17:10', name: '(12.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } :
      (now <= dates.mayTwentySix) ?
        { num: '5', time: '15:50 - 17:10', name: '(26.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } : '',

  ],
  Wednesday: [],
  Thursday: [
    { num: '1', time: '9:00 - 10:20', name: 'Операционные системы лк.', teach: 'Федоркевич Е.В.', cab: '305' },
    { num: '2', time: '10:30 - 11:50', name: 'Базы данных лб.', teach: 'Нуретдинов Р.И.', cab: '109' },
    { num: '3', time: '12:50 - 14:10', name: 'Базы данных лб.', teach: 'Нуретдинов Р.И.', cab: '109' },
    { num: '4', time: '14:20 - 15:40', name: 'Вычислительные системы, сети и телекоммуникации лк.', teach: 'Нуретдинов Р.И.', cab: '109' },
  ],
  Friday: [
    { num: '1', time: '9:00 - 10:20', name: 'Налогообложение лк.', teach: 'Федоркевич Е.В.', cab: '308' },
    { num: '2', time: '10:30 - 11:50', name: 'Безопасность жизнедеятельности пр.', teach: 'Королев В.В.', cab: '308' },
    { num: '3', time: '12:50 - 14:10', name: 'Математическая логика и теория алгоритмов пр.', teach: 'Королев В,В', cab: '305' },
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт. зал' },
  ],
  Saturday: [
    (now <= dates.febSecond) ?
      { num: '1', time: '9:00 - 10:20', name: '(07.02)Мат. логика лк.', teach: 'Игнатьева И.В.', cab: 'ДОТ' } :
      (now <= dates.febTwentyOne) ?
        { num: '1', time: '9:00 - 10:20', name: '(21.02)Мат. логика лк.', teach: 'Игнатьева И.В.', cab: 'ДОТ' } :
        (now <= dates.marchSeven) ?
          { num: '1', time: '9:00 - 10:20', name: '(07.03)Мат. логика лк.', teach: 'Игнатьева И.В.', cab: 'ДОТ' } : '',

    { num: '2', time: '10:30 - 11:50', name: 'Финансы и кредит пр.', teach: 'Смирнов М.О.', cab: 'ДОТ' },

    (now <= dates.febSecond) ?
      { num: '3', time: '12:50 - 14:10', name: '(07.02)Налогообложение лк./пр. ', teach: 'Стецюнич Ю.Н.', cab: 'ДОТ' } :
      (now <= dates.febTwentyOne) ?
        { num: '3', time: '12:50 - 14:10', name: '(21.02)Налогообложение лк./пр. ', teach: 'Стецюнич Ю.Н.', cab: 'ДОТ' } :
        (now <= dates.aprilFour) ?
          { num: '3', time: '12:50 - 14:10', name: '(04.04)Налогообложение лк./пр. ', teach: 'Стецюнич Ю.Н.', cab: 'ДОТ' } : '',
  ],
};

export const PG1Up = {
  Monday: [
    { num: '1', time: '9:00 - 10:20', name: 'Численные методы лк.', teach: 'Голикова Е.И.', cab: '307' },
    { num: '2', time: '10:30 - 11:50', name: 'Численные методы лб.', teach: 'Голанова А.В.', cab: '307' },
    { num: '3', time: '12:50 - 14:10', name: 'Архитектура компьютера лб.', teach: 'Голанова А.В.', cab: '307' },
    { num: '4', time: '14:20 - 15:40', name: 'Теоретические основы информатики лб.', teach: 'Голанова А.В.', cab: '109' }
  ],
  Tuesday: [
    (now <= dates.aprilTwentyEight) ?
      { num: '1', time: '9:00 - 10:20', name: '(12.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } :
      (now <= dates.mayTwentySix) ?
        { num: '1', time: '9:00 - 10:20', name: '(26.05) Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } : '',
    (now <= dates.mayTwelve) ?
      { num: '4', time: '14:20 - 15:40', name: '(12.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } :
      (now <= dates.mayTwentySix) ?
        { num: '4', time: '14:20 - 15:40', name: '(26.05)Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' } : '',
  ],
  Wednesday: [],
  Thursday: [
    { num: '1', time: '9:00 - 10:20', name: 'Операционные системы лк.', teach: 'Федоркевич Е.В.', cab: '305' },
    { num: '2', time: '10:30 - 11:50', name: 'Базы данных лб.', teach: 'Федоркевич Е.В.', cab: '109' },
    { num: '3', time: '12:50 - 14:10', name: 'Базы данных лб.', teach: 'Федоркевич Е.В.', cab: '109' },
    { num: '4', time: '14:20 - 15:40', name: 'Вычислительные системы, сети и телекоммуникации лк.', teach: 'Нуретдинов Р.И.', cab: '109' },
  ],
  Friday: [
    { num: '1', time: '9:00 - 10:20', name: 'Налогообложение пр.', teach: 'Федоркевич Е.В.', cab: '308' },
    { num: '2', time: '10:30 - 11:50', name: 'Безопасность жизнедеятельности пр.', teach: 'Солдатова М. А.', cab: '308' },
    { num: '3', time: '12:50 - 14:10', name: 'Мат. логика лк.', teach: 'Игнатьева И.В.', cab: '305' },
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт. зал' },
  ],
  Saturday: [
    (now <= dates.febSeven) ?
      { num: '1', time: '9:00 - 10:20', name: '(07.02)Мат. логика лк. ', teach: 'Игнатьева И.В.', cab: 'ДОТ' } :
      (now <= dates.febTwentyOne) ?
        { num: '1', time: '9:00 - 10:20', name: '(21.02)Мат. логика пр. ', teach: 'Игнатьева И.В.', cab: 'ДОТ' } :
        (now <= dates.marchSeven) ?
          { num: '1', time: '9:00 - 10:20', name: '(07.03)Мат. логика пр. ', teach: 'Игнатьева И.В.', cab: 'ДОТ' } : '',

    { num: '2', time: '10:30 - 11:50', name: 'Финансы и кредит пр.', teach: 'Смирнов М.О.', cab: 'ДОТ' },

    (now <= dates.febSeven) ?
      { num: '3', time: '12:50 - 14:10', name: '(07.02)Налогообложение лк./пр.', teach: 'Стецюнич Ю.Н.', cab: 'ДОТ' } :
      (now <= dates.febTwentyOne) ?
        { num: '3', time: '12:50 - 14:10', name: '(21.02)Налогообложение лк./пр.', teach: 'Стецюнич Ю.Н.', cab: 'ДОТ' } :
        (now <= dates.aprilFour) ?
          { num: '3', time: '12:50 - 14:10', name: '(04.04)Налогообложение лк./пр.', teach: 'Стецюнич Ю.Н.', cab: 'ДОТ' } : ''
  ],
};

export const PG1Down = {
  Monday: [
    { num: '1', time: '9:00 - 10:20', name: 'Теоретические основы информатики лк.', teach: 'Голикова Е.И.', cab: '307' },
    { num: '2', time: '10:30 - 11:50', name: 'Теоретические основы информатики лб.', teach: 'Голанова А.В.', cab: '307' },
    { num: '3', time: '12:50 - 14:10', name: 'Физ-ра пр.', teach: ' Елисеева Т.П.', cab: 'спорт. зал' },
    { num: '4', time: '14:20 - 15:40', name: 'Теоретические основы информатики лб/лк.', teach: 'Голанова А.В.', cab: '109' }
  ],
  Tuesday: [
    { num: '1', time: '9:00 - 10:20', name: 'Архитектура компьютера лк', teach: 'Голикова Е.И.', cab: '304' },
    { num: '2', time: '10:30 - 11:50', name: 'Численные методы лб.', teach: 'Голанова А.В.', cab: '307' },
    (now <= dates.aprilSeven) ? { num: '3', time: '12:50 - 14:10', name: '(до 07.04)Численные методы лк/лб. ', teach: 'Голанова А.В. ', cab: '307' } : '',
    (now <= dates.febTen) ?
      { num: '4', time: '14:20 - 15:40', name: '(10.02)Физ-ра ', teach: 'Елисеева Т.П.', cab: 'Спорт. зал' } :
      (now <= dates.febTwentyFour) ?
        { num: '4', time: '14:20 - 15:40', name: '(24.02)Физ-ра ', teach: 'Елисеева Т.П.', cab: 'Спорт. зал' } :
        (now <= dates.marchTen) ?
          { num: '4', time: '14:20 - 15:40', name: '(10.03)Физ-ра ', teach: 'Елисеева Т.П.', cab: 'Спорт. зал' } : '',
  ],
  Wednesday: [],
  Thursday: [
    { num: '1', time: '9:00 - 10:20', name: 'Базы данных лк.', teach: 'Федоркевич Е.В.', cab: '305' },
    { num: '2', time: '10:30 - 11:50', name: 'Операционные системы лб.', teach: 'Федоркевич Е.В.', cab: '303' },
    { num: '3', time: '12:50 - 14:10', name: 'Операционные системы лб.', teach: 'Федоркевич Е.В.', cab: '303' },

    (now <= dates.januaryTwentyNine) ? //21.02
      { num: '4', time: '14:20 - 15:40', name: '(29.01)Операционные системы лб.', teach: 'Федоркевич Е.В.', cab: '303' } :
      (now <= dates.febTwelve) ? //12.02
        { num: '4', time: '14:20 - 15:40', name: '(12.02)Операционные системы лб.', teach: 'Федоркевич Е.В.', cab: '303' } :
        (now <= dates.febTwentySix) ? //26.02
          { num: '4', time: '14:20 - 15:40', name: '(26.02)Операционные системы лб.', teach: 'Федоркевич Е.В.', cab: '306' } :
          (now <= dates.marchTwelve) ? //12.03
            { num: '4', time: '14:20 - 15:40', name: '(12.03)Базы данных лк.', teach: 'Федоркевич Е.В.', cab: '305' } :
            (now <= dates.marchTwentySix) ? //26.03
              { num: '4', time: '14:20 - 15:40', name: '(26.03)Базы данных лб.', teach: 'Федоркевич Е.В.', cab: '109' } :
              (now <= dates.aprilFour) ? //04.04
                { num: '4', time: '14:20 - 15:40', name: '(04.04)Базы данных лб.', teach: 'Федоркевич Е.В.', cab: '109' } : ''
  ],
  Friday: [
    { num: '1', time: '9:00 - 10:20', name: 'Налогообложение пр.', teach: 'Федоркевич Е.В.', cab: '304' },
    { num: '2', time: '10:30 - 11:50', name: 'Безопасность жизнедеятельности пр.', teach: 'Солдатова М. А.', cab: '109' },
    { num: '3', time: '12:50 - 14:10', name: 'Мат. логика лк.', teach: 'Игнатьева И.В.', cab: '305' },
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Елисеева Т.П., ст.пр. Василевская С.Л.', cab: 'спорт. зал' },
  ],
  Saturday: [
    { num: '1', time: '9:00 - 10:20', name: 'Вычислительные системы, сети и телекоммуникации', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' },
    { num: '2', time: '10:30 - 11:50', name: 'Вычислительные системы, сети и телекоммуникации', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' },
    { num: '5', time: '15:50 - 17:10', name: 'Финансы и кредит лк.', teach: 'Смирнов М.О.', cab: 'ДОТ' },

    (now <= dates.marchFourteen) ? { num: '6', time: '17:20 - 18:40', name: 'Финансы и кредит лк/пр.', teach: 'Смирнов М.О.', cab: 'ДОТ' } : '',
  ],
}

export const PG2Down = {
  Monday: [
    { num: '1', time: '9:00 - 10:20', name: 'Теоретические основы информатики лк.', teach: 'Голикова Е.И.', cab: '307' },
    { num: '2', time: '10:30 - 11:50', name: 'Теоретические основы информатики лб.', teach: 'Голикова Е.И.', cab: '307' },
    { num: '3', time: '12:50 - 14:10', name: 'Физ-ра пр.', teach: 'Брусова И.Н.', cab: 'спорт. зал' },
    { num: '4', time: '14:20 - 15:40', name: 'Теоретические основы информатики лб/лк.', teach: 'Голикова Е.И.', cab: '109' }
  ],
  Tuesday: [
    { num: '1', time: '9:00 - 10:20', name: 'Архитектура компьютера лк', teach: 'Голикова Е.И.', cab: '304' },
    { num: '2', time: '10:30 - 11:50', name: 'Численные методы лб.', teach: 'Голикова Е.И.', cab: '307' },

    (now <= dates.aprilSeven) ? //07.04
      { num: '3', time: '12:50 - 14:10', name: '(до 07.04)Численные методы лк/лб. ', teach: 'Голикова Е.И.', cab: '307' } : '',

    (now <= dates.febTen) ? //10.02
      { num: '4', time: '14:20 - 15:40', name: '(10.02)Физ-ра ', teach: 'Брусова И.Н.', cab: 'Спорт. зал' } :
      (now <= dates.febTwentyFour) ? //21.02
        { num: '4', time: '14:20 - 15:40', name: '(24.02)Физ-ра ', teach: 'Брусова И.Н.', cab: 'Спорт. зал' } :
        (now <= dates.marchTen) ? //10.03
          { num: '4', time: '14:20 - 15:40', name: '(10.03)Физ-ра ', teach: 'Брусова И.Н.', cab: 'Спорт. зал' } : '',
  ],
  Wednesday: [],
  Thursday: [
    { num: '1', time: '9:00 - 10:20', name: 'Базы данных лк.', teach: 'Федоркевич Е.В.', cab: '305' },
    { num: '2', time: '10:30 - 11:50', name: 'Операционные системы лб.', teach: 'Королев В.В.', cab: '306' },
    { num: '3', time: '12:50 - 14:10', name: 'Операционные системы лб.', teach: 'Королев В.В.', cab: '306' },

    (now <= dates.januaryTwentyNine) ? //21.02
      { num: '4', time: '14:20 - 15:40', name: '(29.01)Операционные системы лб.', teach: 'Королев В.В.', cab: '306' } :
      (now <= dates.febTwelve) ? //12.02
        { num: '4', time: '14:20 - 15:40', name: '(12.02)Операционные системы лб.', teach: 'Королев В.В.', cab: '306' } :
        (now <= dates.febTwentySix) ? //26.02
          { num: '4', time: '14:20 - 15:40', name: '(26.02)Операционные системы лб.', teach: 'Федоркевич Е.В.', cab: '306' } :
          (now <= dates.marchTwelve) ? //12.03
            { num: '4', time: '14:20 - 15:40', name: '(12.03)Базы данных лк.', teach: 'Федоркевич Е.В.', cab: '305' } :
            (now <= dates.marchTwentySix) ? //26.03
              { num: '4', time: '14:20 - 15:40', name: '(26.03)Базы данных лб.', teach: 'Нуретдинов Р.И.', cab: '109' } :
              (now <= dates.aprilFour) ? //04.04
                { num: '4', time: '14:20 - 15:40', name: '(04.04)Базы данных лб.', teach: 'Нуретдинов Р.И.', cab: '109' } : ''
  ],
  Friday: [
    { num: '1', time: '9:00 - 10:20', name: 'Налогообложение пр.', teach: 'Федоркевич Е.В.', cab: '304' },
    { num: '2', time: '10:30 - 11:50', name: 'Безопасность жизнедеятельности пр.', teach: 'Солдатова М. А.', cab: '109' },
    { num: '3', time: '12:50 - 14:10', name: 'Мат. логика лк.', teach: 'Игнатьева И.В.', cab: '305' },
    { num: '4', time: '14:20 - 15:40', name: 'Физ-ра пр.', teach: 'Брусова И.Н.', cab: 'спорт. зал' },
  ],
  Saturday: [
    { num: '3', time: '12:50 - 14:10', name: 'Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' },
    { num: '4', time: '14:20 - 15:40', name: 'Вычислительные системы, сети и телекоммуникации лб.', teach: 'Нуретдинов Р.И.', cab: 'ДОТ' },
    { num: '5', time: '15:50 - 17:10', name: 'Финансы и кредит лк.', teach: 'Смирнов М.О.', cab: 'ДОТ' },
    (now <= dates.marchFourteen) ?
      { num: '6', time: '17:20 - 18:40', name: '(до 14.03)Финансы и кредит лк/пр.', teach: 'Смирнов М.О.', cab: 'ДОТ' } : ''
  ],
};
